Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/taking_a_civil_case_intro.html.txt.tmx
Source language: en
Languages: ga

source: Taking a civil case
ga: Cás Sibhialta a thógáil

source: Civil cases usually involve private disputes between persons or organizations, such as, disputes involving accidents or breaches of contract
ga: Is gnách go mbíonn díospóidí príobháideacha i gceist le cásanna sibhialta idir daoine nó eagraíochtaí, ar nós, díospóidí ina bhfuil baint ag timpistí nó sáruithe ar chonradh

source: Before commencing proceedings in your civil case, a number of matters will arise such as instructing a solicitor and the issue of the cost of the case
ga: Sula gcuirtear tús le himeachtaí i do chás sibhialta, tiocfaidh roinnt saincheisteanna aníos, ar nós treoracha a thabhairt d’aturnae agus an cheist a bhaineann le costas an cháis

source: To commence proceedings, you must issue and serve a written court document called a writ or pleading
ga: Chun tús a chur le himeachtaí, ní mór duit cáipéis scríofa chúirte a eisiúint agus a sheirbheáil, ar a dtugtar eascaire nó pléadáil

source: Many cases do not get to court because they are settled in advance
ga: Ní bhaineann go leor cásanna an chúirt amach mar gheall go réitítear iad roimh ré

source: Our settlement of claims document explains the issues surrounding settlements and lodgements
ga: Mínítear inár gcáipéis, réiteach éileamh na saincheisteanna a bhaineann le réitigh agus lóisteálacha

source: After the court case, if you are unhappy with the outcome, you can appeal the decision
ga: I ndiaidh chás na cúirte, mura bhfuil tú sásta leis an toradh, féadfaidh tú an cinneadh a achomharc

source: If you are taking a case, there are various types of civil claims that you may take to court
ga: Má tá cás á ghlacadh agat, tá roinnt saghsanna d’éilimh shibhialta is féidir leat a ghlacadh chun na cúirte

source: Many civil claims are personal injuries claims that are brought as a result of road traffic accidents, accidents at work and slipping or tripping and falling in a shop, on a road or a public place
ga: Éilimh ar dhíobhálacha pearsanta iad go leor éileamh a dhéantar mar thoradh ar thimpistí um thrácht ar bhóithre, timpistí san ionad oibre agus sleamhnú nó tuisliú nó titim i siopa, ar bhóthar nó in áit phoiblí

source: It is important to note that you cannot pursue a personal injuries action through the courts without first submitting your claim to the InjuriesBoard.ie process
ga: Is tábhachtach a thabhairt faoi deara nach féidir leat tabhairt faoi chaingean díobhálacha pearsanta trí na cúirteanna gan d’éileamh a sheoladh ar aghaidh chuig próiseas an Bhoird Mheasúnaithe Díobhálacha Pearsanta ar dtús

source: You may have a claim based on breach of contract or based on a neighbour's interference with your enjoyment of your property - nuisance claims
ga: B’fhéidir go bhfuil éileamh agat bunaithe ar shárú conartha nó má chuir comharsan isteach ort taitneamh a bhaint as do réadmhaoin – éilimh núise

source: Another type of case is a claim for damages as a result of defamation, that is, when a person’s reputation is injured as a result of the publication by any means, orally or in writing, of untruths about the person
ga: Saghas eile d’éileamh is ea éileamh ar dhamáistí mar thoradh ar chlúmhilleadh, is é sin, nuair a bhaintear den cháil atá ar dhuine mar thoradh ar neamhfhírinní faoin duine a fhoilsiú ar aon bhealach, ó bhéal nó i scríbhinn

source: You may have a claim in relation to ownership of land or you may require the court to sort out arrangements in respect of marital breakdown
ga: B’fhéidir go bhfuil éileamh agat maidir le húinéireacht talún nó b’fhéidir gur féidir leat iarraidh ar an gcúirt socruithe a eagrú maidir le cliseadh pósta

source: Whether your case is heard in the District Court, the Circuit Court or the High Court will depend on the value of your case, that is, how much you claim the defendant should pay you
ga: Braithfidh cibé acu an éistear le do chás sa Chúirt Dúiche, sa Chúirt Chuarda nó san Ard-Chúirt ar luach do cháis, is é sin, cé mhéid a éilíonn tú ar cheart don chosantóir a íoc leat

source: If you have been injured in an accident, the value of your case will be assessed by your legal representatives by considering doctors' reports about the nature and extent of your injuries and the prognosis for the future
ga: Má gortaíodh thú i dtimpiste, déanfaidh d’ionadaithe dlí measúnú ar do chás trí bhreithniú a dhéanamh ar thuairiscí dochtúirí faoi chineál agus méid do chuid díobhálacha agus an phrognóis don todhchaí

source: The District Court has power to award up to €15,000 in damages
ga: Tá an chumhacht ag an gCúirt Dúiche a mhéid le €15,000 a bhronnadh ort i ndamáistí

source: The Circuit Court has power to award up to €75,000 in damages
ga: Tá an chumhacht ag an gCúirt Dúiche a mhéid le €75,000 a bhronnadh ort i ndamáistí

source: The High Court has unlimited power to award damages
ga: Tá cumhacht neamhtheoranta ar an Ard-Chúirt chun damáistí a bhronnadh

source: It is important to note that, if your case is heard in Circuit Court and you are awarded less than €15,000 in damages or in the High Court and you are awarded less than €75,000 in damages, you may be penalised in costs
ga: Is tábhachtach a thabhairt faoi deara, má éistear le do chás sa Chúirt Chuarda agus má bhronntar níos lú ná €15,000 ort i ndamáistí nó má éistear le do chás san Ard-Chúirt agus má bhronntar níos lú ná €75,000 i ndamáistí, féadtar pionós a ghearradh ó thaobh costas de

source: This means that even though you have won your case, you may be obliged to pay the extra costs incurred by both sides by having the case heard in the higher court
ga: Ciallaíonn seo, fiú má d’éirigh leat i do chás, b’fhéidir go mbeidh dualgas ort na costais bhreise a thabhaigh an dá thaobh mar gheall gur éisteadh leis an gcás sa chúirt ní b’uachtaraí

source: Time limits for actions
ga: Teorainneacha ama le haghaidh caingne

source: The time limits for commencing proceedings are legislated for in the Statute of Limitations 1957
ga: Déantar na teorainneacha ama chun tús a chur le himeachtaí a reachtú i Reacht na dTréimhsí, 1957

source: Under the Civil Liability & Courts Act 2004, a personal injuries claim must be commenced within 2 years
ga: Faoin Acht um Dhiteanas Sibhialta agus Cúirteanna, 2004, ní mór tús a chur le héileamh ar dhíobhálacha pearsanta laistigh de 2 bhliain

source: A claim based on nuisance, that is, where a person has interfered with your enjoyment of your property, must be brought within 3 years of the nuisance
ga: Ní mór éileamh atá bunaithe ar núis, is é sin, nuair a chuir duine isteach ar an taitneamh a bhaineann tú as do réadmhaoin, a dhéanamh laistigh de 3 bliana tar éis na núise

source: A claim based on breach of contract must be brought within 6 years of the breach
ga: Ní mór éileamh bunaithe ar shárú conartha a dhéanamh laistigh de 6 bliana tar éis an tsáraithe

source: A claim based on defamation must be brought within 1 year of the publication
ga: Ní mór éileamh bunaithe ar chlúmhilleadh a dhéanamh laistigh de 1 bhliain tar éis an fhoilsithe

source: Cases relating to land generally must be brought within 12 years
ga: Ní mór cásanna a bhaineann le talamh a dhéanamh go ginearálta laistigh de 12 bhliain
